czstara12/lckfb-daplink/1_Code/GD32F407/applications/DAP_config.h
For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO
peripherals that can independently write/read a single I/O pin without affecting any other pins
of the same I/O port. The following SWDIO I/O Pin functions are provided:
 - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
 - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
 - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
 - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/

extern char volatile current_dap_mode;

// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
__STATIC_INLINE void PORT_JTAG_SETUP(void)
{

  current_dap_mode = 2;
  RCU_AHB1EN |= (uint32_t)(1 << 4); // 开启GPIOE的端口时钟
  RCU_AHB1EN |= (uint32_t)(1 << 3); // 开启GPIOD的端口时钟

  // - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.

  // TCK/SWCLK: E07,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(uint32_t)(0x03 << (2 * 7));
  // TCK/SWCLK: E07,设置为输出模式
  GPIO_CTL(GPIOE) |= (uint32_t)(0x01 << (2 * 7));
  // TCK/SWCLK: E07,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 7));
  // TCK/SWCLK: E07,设置为无上下拉模式
  GPIO_PUD(GPIOE) |= (uint32_t)(0x00 << (2 * 7));
  // TCK/SWCLK: E07,对引脚速度寄存器清0
  GPIO_OSPD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 7));
  // TCK/SWCLK: E07,设置为输出速度等级1，25Mhz
  GPIO_OSPD(GPIOE) |= (uint32_t)(0x00 << (2 * 7));

  // TMS/SWDIO: E08,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(uint32_t)(0x03 << (2 * 8));
  // TMS/SWDIO: E08,设置为输出模式
  GPIO_CTL(GPIOE) |= (uint32_t)(0x01 << (2 * 8));
  // TMS/SWDIO: E08,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 8));
  // TMS/SWDIO: E08,设置为无上下拉模式
  GPIO_PUD(GPIOE) |= (uint32_t)(0x00 << (2 * 8));
  // TMS/SWDIO: E08,对引脚速度寄存器清0
  GPIO_OSPD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 8));
  // TMS/SWDIO: E08,设置为输出速度等级1，25Mhz
  GPIO_OSPD(GPIOE) |= (uint32_t)(0x00 << (2 * 8));
  // TDI
  GPIO_CTL(GPIOE) &= ~(uint32_t)(0x03 << (2 * 12)); // TDI:
                                          // E12,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) |= (uint32_t)(0x01 << (2 * 12)); // TDI: E12,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 12)); // TDI: E12,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (uint32_t)(0x01 << (2 * 12)); // TDI: E12,设置为上拉模式
  GPIO_OSPD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 12)); // TDI: E12,对引脚速度寄存器清0
  GPIO_OSPD(GPIOE) |= (uint32_t)(0x00 << (2 * 12)); // TDI: E12,设置为输出速度等级1，25Mhz

  // nRESET
  // nRESET: E10,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(uint32_t)(0x03 << (2 * 10));
  GPIO_CTL(GPIOE) |= (uint32_t)(0x01 << (2 * 10)); // nRESET: E10,设置为输出模式
  GPIO_CTL(GPIOE) |= (uint32_t)(0x01 << (2 * 10)); // nRESET: E10,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(uint32_t)(0x03 << (2 * 10)); // nRESET: E10,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (uint32_t)(0x01 << (2 * 10)); // nRESET: E10,设置为上拉模式
  GPIO_OMODE(GPIOE) |= (uint32_t)(0x01 << (10));   // nRESET: E10,配置为开漏模式

  GPIOE_OUTPUT(7) = 1;  // 输出高电平
  GPIOE_OUTPUT(8) = 1;  // 输出高电平
  GPIOE_OUTPUT(12) = 1; // 输出高电平
  GPIOE_OUTPUT(10) = 1; // 输出高电平

  //- TDO to input mode.
  // TDO
  GPIO_CTL(GPIOD) &= ~((uint32_t)0x03 << (uint32_t)(2 * 6)); // TDO:
                                          // D06,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOD) |= ((uint32_t)0x00 << (uint32_t)(2 * 6)); // TDO: D06,设置为输入模式
  GPIO_PUD(GPIOD) &= ~((uint32_t)0x03 << (uint32_t)(2 * 6)); // TDO: D06,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOD) |= ((uint32_t)0x00 << (uint32_t)(2 * 6)); // TDO: D06,设置为无上下拉模式
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/
__STATIC_INLINE void PORT_SWD_SETUP(void)
{
  current_dap_mode = 1;

  RCU_AHB1EN |= (uint32_t)(1 << 4); // 开启GPIOE的端口时钟
  RCU_AHB1EN |= (uint32_t)(1 << 3); // 开启GPIOD的端口时钟

  //- SWCLK, SWDIO, nRESET to output mode and set to default high level.
  // TCK/SWCLK
  // TCK/SWCLK: E07,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 7));
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 7)); // TCK/SWCLK: E07,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 7)); // TCK/SWCLK: E07,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 7)); // TCK/SWCLK: E07,设置为无上下拉模式
  GPIO_OSPD(GPIOE) &= ~(0x03 << (2 * 7)); // TCK/SWCLK: E07,对引脚速度寄存器清0
  // TCK/SWCLK: E07,设置为输出速度等级1，25Mhz
  GPIO_OSPD(GPIOE) |= (0x00 << (2 * 7));

  // TMS/SWDIO
  // TMS/SWDIO: E08,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 8));
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 8)); // TMS/SWDIO: E08,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 8)); // TMS/SWDIO: E08,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 8)); // TMS/SWDIO: E08,设置为无上下拉模式
  GPIO_OSPD(GPIOE) &= ~(0x03 << (2 * 8)); // TMS/SWDIO: E08,对引脚速度寄存器清0
  // TMS/SWDIO: E08,设置为输出速度等级1，25Mhz
  GPIO_OSPD(GPIOE) |= (0x00 << (2 * 8));

  // nRESET
  // nRESET: E10,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 10));
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 10)); // nRESET: E10,设置为输出模式
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 10)); // nRESET: E10,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 10)); // nRESET: E10,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x01 << (2 * 10)); // nRESET: E10,设置为上拉模式
  GPIO_OMODE(GPIOE) |= (0x01 << (10));   // nRESET: E12,配置为开漏模式

  GPIOE_OUTPUT(7) = 1;  // 输出高电平
  GPIOE_OUTPUT(8) = 1;  // 输出高电平
  GPIOE_OUTPUT(10) = 1; // 输出高电平
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF(void)
{
//  current_dap_mode = 0;
  //- SWCLK, SWDIO, nRESET to output mode and set to default high level.

  // TCK/SWCLK
  // TCK/SWCLK: E07,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 7));
  GPIO_CTL(GPIOE) |= (0x00 << (2 * 7)); // TCK/SWCLK: E07,设置为输入模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 7)); // TCK/SWCLK: E07,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 7)); // TCK/SWCLK: E07,设置为无上下拉模式

  // TMS/SWDIO
  // TMS/SWDIO: E08,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 8));
  GPIO_CTL(GPIOE) |= (0x00 << (2 * 8)); // TMS/SWDIO: E08,设置为输入模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 8)); // TMS/SWDIO: E08,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 8)); // TMS/SWDIO: E08,设置为无上下拉模式

