czstara12/lckfb-daplink/1_Code/GD32F407/applications/DAP_config.h
  // nRESET
  // nRESET: E10,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 10));
  GPIO_CTL(GPIOE) |= (0x00 << (2 * 10)); // nRESET: E10,设置为输入模式
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 10)); // nRESET: E10,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 10)); // nRESET: E10,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 10)); // nRESET: E10,设置为无上下拉模式
  GPIO_OMODE(GPIOE) |= (0x01 << (10)); // nRESET: E12,配置为开漏模式
}

// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
  return (GPIOE_INPUT(7));
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_SET (void) {
  GPIOE_OUTPUT(7) = 1;
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_CLR (void) {
  GPIOE_OUTPUT(7) = 0;
}


// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN  (void) {
  return (GPIOE_INPUT(8));
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_SET (void) {
  GPIOE_OUTPUT(8) = 1;
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_CLR (void) {
  GPIOE_OUTPUT(8) = 0;
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN      (void) {
  return (GPIOE_INPUT(8));
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT     (uint32_t bit) {
  GPIOE_OUTPUT(8) = bit;
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_FORCEINLINE void PIN_SWDIO_OUT_ENABLE(void)
{

  // TMS/SWDIO
  // TMS/SWDIO: E08,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 8));
  GPIO_CTL(GPIOE) |= (0x01 << (2 * 8)); // TMS/SWDIO: E08,设置为输出模式
  GPIO_PUD(GPIOE) &= ~(0x03 << (2 * 8)); // TMS/SWDIO: E08,对GPIO上下拉寄存器清0
  GPIO_PUD(GPIOE) |= (0x00 << (2 * 8)); // TMS/SWDIO: E08,设置为无上下拉模式

  // 默认就是推挽输出
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_FORCEINLINE void PIN_SWDIO_OUT_DISABLE(void)
{
  // TMS/SWDIO: E08,对GPIO输入输出模式寄存器清0
  GPIO_CTL(GPIOE) &= ~(0x03 << (2 * 8));
  // TMS/SWDIO: E08,设置为输入模式
  GPIO_CTL(GPIOE) |= (0x00 << (2 * 8));
}

// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDI_IN  (void) {
  return (GPIOE_INPUT(12));
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_TDI_OUT (uint32_t bit) {
  GPIOE_OUTPUT(12) = bit;
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDO_IN  (void) {
  return (GPIOD_INPUT(6));
}


// nTRST Pin I/O -------------------------------------------

/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN   (void) {
  return (0U);
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
           - 0: issue a JTAG TRST Test Reset.
           - 1: release JTAG TRST Test Reset.
*/
__STATIC_FORCEINLINE void     PIN_nTRST_OUT  (uint32_t bit) {
  ;
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nRESET_IN  (void) {
  return (GPIOE_INPUT(10));
}

#include "debug_cm.h"

extern uint8_t swd_read_word(uint32_t addr, uint32_t *val);
extern uint8_t swd_write_word(uint32_t addr, uint32_t val);

extern  void soft_reset_target(void);

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
__STATIC_FORCEINLINE void     PIN_nRESET_OUT (uint32_t bit) {

    GPIOE_OUTPUT(10) = bit;

    rt_kprintf("in reset\r\n");

    if(0 == bit)
    {
        soft_reset_target();
    }
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

It is recommended to provide the following LEDs for status indication:
 - Connect LED: is active when the DAP hardware is connected to a debugger.
 - Running LED: is active when the debugger has put the target device into running state.
*/

/** Debug Unit: Set status of Connected LED.
\param bit status of the Connect LED.
           - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
           - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
*/
__STATIC_INLINE void LED_CONNECTED_OUT (uint32_t bit) {}

/** Debug Unit: Set status Target Running LED.
\param bit status of the Target Running LED.
           - 1: Target Running LED ON: program execution in target started.
           - 0: Target Running LED OFF: program execution in target stopped.
*/
__STATIC_INLINE void LED_RUNNING_OUT (uint32_t bit) {GPIOB_OUTPUT(2) = bit;}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Timestamp_gr CMSIS-DAP Timestamp
\ingroup DAP_ConfigIO_gr
@{
Access function for Test Domain Timer.

The value of the Test Domain Timer in the Debug Unit is returned by the function \ref TIMESTAMP_GET. By
default, the DWT timer is used.  The frequency of this timer is configured with \ref TIMESTAMP_CLOCK.

*/

