czstara12/lckfb-daplink/1_Code/GD32F407/applications/DAP_config.h
/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
__STATIC_INLINE uint32_t TIMESTAMP_GET (void) {
  return (0);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
__STATIC_INLINE void DAP_SETUP (void) {
  ;
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/

__STATIC_INLINE uint8_t RESET_TARGET (void) {
//  static uint32_t val;
//  rt_kprintf("in reset\r\n");

//  // Perform a soft reset
//  if (!swd_read_word((0xe000e000) + 0x0D0C, &val)) {
//      rt_kprintf("swd_read_word is %x\r\n",val);
//      return 0;
//  }

//  if (!swd_write_word((0xe000e000) + 0x0D0C, 0x05FA0000 | (val & SCB_AIRCR_PRIGROUP_Msk) | 0x00000004)) {
//      rt_kprintf("swd_write_word is %x\r\n",val);
//      return 0;
//  }
//  rt_kprintf("RESET_TARGET!!swd_read_word is %x\r\n",val);

    return (1U);             // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
